esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
    lv_obj_add_flag(ui.instructions_label, LV_OBJ_FLAG_HIDDEN);

    // Instructions frame styling
    lv_obj_set_style_bg_color(ui.instructions_label, WWTBAM_BLUE_DARK, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(ui.instructions_label, LV_OPA_80, LV_PART_MAIN);
    lv_obj_set_style_border_color(ui.instructions_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_set_style_border_width(ui.instructions_label, 2, LV_PART_MAIN);
    lv_obj_set_style_radius(ui.instructions_label, 16, LV_PART_MAIN);
    lv_obj_set_style_pad_all(ui.instructions_label, 20, LV_PART_MAIN);


    // Question box (framed, centered)
    ui.question_label = lv_label_create(ui.root);
    lv_label_set_long_mode(ui.question_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_line_space(ui.question_label, 5, LV_PART_MAIN);
    lv_obj_set_width(ui.question_label, 700);
    lv_obj_align(ui.question_label, LV_ALIGN_TOP_MID, 0, 20);

    lv_obj_set_style_text_font(ui.question_label, &lv_font_dejavu_24_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.question_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_obj_set_style_text_align(ui.question_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);

    lv_obj_add_flag(ui.instructions_label, LV_OBJ_FLAG_HIDDEN);

    // Frame styling
    lv_obj_set_style_bg_color(ui.question_label, WWTBAM_BLUE_DARK, LV_PART_MAIN);
    lv_obj_set_style_bg_opa(ui.question_label, LV_OPA_80, LV_PART_MAIN);
    lv_obj_set_style_border_color(ui.question_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_obj_set_style_border_width(ui.question_label, 2, LV_PART_MAIN);
    lv_obj_set_style_radius(ui.question_label, 16, LV_PART_MAIN);
    lv_obj_set_style_pad_all(ui.question_label, 20, LV_PART_MAIN);

    // Score label (top-left)
    ui.score_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.score_label, &lv_font_dejavu_16_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.score_label, WWTBAM_WHITE, LV_PART_MAIN);
    lv_obj_align(ui.score_label, LV_ALIGN_TOP_LEFT, 10, 10);

    // Countdown label (bottom middle)
    ui.countdown_label = lv_label_create(ui.root);
    lv_obj_set_style_text_font(ui.countdown_label, &lv_font_dejavu_18_german, LV_PART_MAIN);
    lv_obj_set_style_text_color(ui.countdown_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_obj_align(ui.countdown_label, LV_ALIGN_BOTTOM_LEFT, 10, -10);

    // System message label (bottom center - used for reactions and instructions)
    ui.system_message_label = lv_label_create(ui.root);
    lv_obj_set_style_text_align(ui.system_message_label, LV_TEXT_ALIGN_CENTER, LV_PART_MAIN);
    lv_obj_set_style_text_font(ui.system_message_label, &lv_font_dejavu_18_german, LV_PART_MAIN);
    lv_label_set_long_mode(ui.system_message_label, LV_LABEL_LONG_WRAP);
    lv_obj_set_style_text_line_space(ui.system_message_label, 3, LV_PART_MAIN);
    lv_obj_set_width(ui.system_message_label, 600);
    lv_obj_align(ui.system_message_label, LV_ALIGN_BOTTOM_MID, 0, -10);
    lv_obj_add_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);

    // Create LVGL button widgets (3 buttons)
    const int frame_width = 700;
    const int frame_height = 80;
    const int spacing = 20;

    for (int i = 0; i < 3; i++) {

        // Outer frame (button + text)
        ui.answer_frames[i] = lv_obj_create(ui.root);
        lv_obj_set_size(ui.answer_frames[i], frame_width, frame_height);
        lv_obj_align(ui.answer_frames[i], LV_ALIGN_CENTER, 0, (i - 1) * (frame_height + spacing));

        lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_BLUE_DARK, LV_PART_MAIN);
        lv_obj_set_style_bg_opa(ui.answer_frames[i], LV_OPA_80, LV_PART_MAIN);
        lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_border_width(ui.answer_frames[i], 2, LV_PART_MAIN);
        lv_obj_set_style_radius(ui.answer_frames[i], 16, LV_PART_MAIN);
        lv_obj_set_style_pad_all(ui.answer_frames[i], 10, LV_PART_MAIN);

        // BUTTON inside the frame
        ui.buttons[i] = lv_button_create(ui.answer_frames[i]);
        lv_obj_set_size(ui.buttons[i], 120, 60);
        lv_obj_align(ui.buttons[i], LV_ALIGN_LEFT_MID, 0, 0);

        lv_color_t btn_color =
            (i == 0) ? WWTBAM_BLUE :
            (i == 1) ? WWTBAM_GREEN_DARK :
                    LV_COLOR_RED;

        lv_obj_set_style_bg_color(ui.buttons[i], btn_color, LV_PART_MAIN);
        lv_obj_set_style_border_color(ui.buttons[i], WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_border_width(ui.buttons[i], 1, LV_PART_MAIN);
        lv_obj_set_style_radius(ui.buttons[i], 12, LV_PART_MAIN);

        // Letter label (A/B/C)
        lv_obj_t *letter = lv_label_create(ui.buttons[i]);
        lv_label_set_text(letter, (i == 0) ? "A" : (i == 1) ? "B" : "C");
        lv_obj_set_style_text_color(letter, WWTBAM_GOLD, LV_PART_MAIN);
        lv_obj_set_style_text_font(letter, &lv_font_dejavu_20_german, LV_PART_MAIN);
        lv_obj_center(letter);

        // Answer text OUTSIDE the button, inside the frame
        ui.answer_labels[i] = lv_label_create(ui.answer_frames[i]);
        lv_obj_set_style_text_color(ui.answer_labels[i], WWTBAM_WHITE, LV_PART_MAIN);
        lv_obj_set_style_text_font(ui.answer_labels[i], &lv_font_dejavu_18_german, LV_PART_MAIN);
        lv_obj_align(ui.answer_labels[i], LV_ALIGN_LEFT_MID, 150, 0);
    }

}

static void highlight_answer_frame(int index)
{
    for (int i = 0; i < 3; i++) {
        if (i == index) {
            // Selected frame
            lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_HIGHLIGHT_BG, LV_PART_MAIN);
            lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_HIGHLIGHT_BORDER, LV_PART_MAIN);
            lv_obj_set_style_border_width(ui.answer_frames[i], 5, LV_PART_MAIN);
        } else {
            // Reset others
            lv_obj_set_style_bg_color(ui.answer_frames[i], WWTBAM_BLUE_DARK, LV_PART_MAIN);
            lv_obj_set_style_border_color(ui.answer_frames[i], WWTBAM_GOLD, LV_PART_MAIN);
            lv_obj_set_style_border_width(ui.answer_frames[i], 2, LV_PART_MAIN);
        }
    }
}

static void update_score_display(void)
{
    if (!ui.score_label) return;
    char buf[32];
    snprintf(buf, sizeof(buf), "Punkte: %d", score);
    lv_label_set_text(ui.score_label, buf);
}

static void update_countdown_display(void)
{
    if (!ui.countdown_label) return;
    char buf[32];
    snprintf(buf, sizeof(buf), "Zeit: %d", timer_remaining);
    lv_label_set_text(ui.countdown_label, buf);
}

static void show_question_ui(int q_index)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BG, LV_PART_MAIN);

    lv_obj_clear_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_clear_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.title_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.instructions_label, LV_OBJ_FLAG_HIDDEN);

