esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
    highlight_answer_frame(-1);  // reset highlights 

    for (int i = 0; i < 3; i++) {
        lv_obj_clear_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }

    lv_label_set_text(ui.question_label, quiz_questions[q_index].question);

    lv_label_set_text(ui.answer_labels[0], quiz_questions[q_index].answer_a);
    lv_label_set_text(ui.answer_labels[1], quiz_questions[q_index].answer_b);
    lv_label_set_text(ui.answer_labels[2], quiz_questions[q_index].answer_c);

    update_score_display();

    timer_remaining = get_timer_duration(quiz_questions[q_index].difficulty);
    update_countdown_display();
}

static void show_reaction_ui(bool correct, const char *custom_message)
{
    if (!ui.system_message_label) return;

    const char *reaction;
    if (custom_message) {
        reaction = custom_message;
    } else {
        reaction = correct ?
                   quiz_questions[current_question_index].correct_reaction :
                   quiz_questions[current_question_index].wrong_reaction;
    }

    lv_label_set_text(ui.system_message_label, reaction);
    lv_obj_set_style_text_color(ui.system_message_label,
                                correct ? LV_COLOR_GREEN : LV_COLOR_RED,
                                LV_PART_MAIN);

    lv_obj_clear_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);
}

static void show_winner_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BG, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }

    // Show title label
    lv_obj_clear_flag(ui.title_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.title_label, "Herzlichen Glückwunsch!");

    // Show instructions label with additional info
    lv_obj_clear_flag(ui.instructions_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.instructions_label,
        "Du hast das Quiz gewonnen!\n"
        "Der Code zum Finale lautet:\n\n"
        "7777"
    );
}

static void show_fail_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BG, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }

    // Show title label
    lv_obj_clear_flag(ui.title_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.title_label, "Oh nein, du hast leider verloren!");

    // Show instructions label with question
    lv_obj_clear_flag(ui.instructions_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.instructions_label, "Möchtest du es nochmal versuchen?");

    // Show system message with button instructions
    lv_obj_clear_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_style_text_color(ui.system_message_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_label_set_text(ui.system_message_label,
        "Betätige die grüne Taste für einen neuen Versuch.\n"
        "Halte die rote Taste gedrückt, um das Spiel zu beenden.");
}

static void show_shutdown_prompt_ui(void)
{
    create_quiz_ui_once();

    // Keep the winner UI background and content
    // Show system message at bottom
    lv_obj_clear_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.system_message_label, "Drücke eine beliebige Taste, um das Spiel zu beenden.");
    lv_obj_set_style_text_color(ui.system_message_label, WWTBAM_GOLD, LV_PART_MAIN);
}

static void show_start_screen_ui(void)
{
    create_quiz_ui_once();

    lv_obj_set_style_bg_color(ui.root, WWTBAM_BG, LV_PART_MAIN);

    // Hide quiz elements
    lv_obj_add_flag(ui.question_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.score_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.countdown_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_add_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);
    for (int i = 0; i < NUM_BUTTONS; i++) {
        lv_obj_add_flag(ui.answer_frames[i], LV_OBJ_FLAG_HIDDEN);
    }

    // Show center label with welcome message
    lv_obj_clear_flag(ui.title_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_style_text_color(ui.system_message_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_label_set_text(ui.title_label, "Herzlich Willkommen im Quiz-Hotel!");

    // Show instructions label
    lv_obj_clear_flag(ui.instructions_label, LV_OBJ_FLAG_HIDDEN);
    lv_label_set_text(ui.instructions_label,
        "Spielregeln:\n"
        "1. Antworte innerhalb der vorgegebenen Zeit!\n"
        "2. Für eine richtige Antwort bekommst du einen Punkt.\n"
        "3. Für eine falsche Antwort wird ein Punkt abgezogen.\n"
        "4. Die nächste Frage erscheint automatisch.\n"
        "5. Bei 10 Punkten erhälst du eine Belohnung.\n"
        "6. Nach höchstens 50 Versuchen ist das Spiel vorbei."
    );

    // Show system message to start
    lv_obj_clear_flag(ui.system_message_label, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_style_text_color(ui.system_message_label, WWTBAM_GOLD, LV_PART_MAIN);
    lv_label_set_text(ui.system_message_label, "Betätige eine beliebige Taste, um zu starten.");
}

// === Quiz timer callback (only uses LVGL safely, no deletes) ================

static void quiz_timer_callback(lv_timer_t *timer)
{
    static int second_counter = 0;
    static int winner_counter = 0;
    static int fail_counter = 0;

    second_counter++;

    ESP_LOGV("QUIZ", "Timer callback: state=%d, second_counter=%d", quiz_state, second_counter);

    switch (quiz_state) {
    case QUIZ_STATE_SHOWING_QUESTION: {
        ESP_LOGI("QUIZ", "Timer: SHOWING_QUESTION - selecting question");
        current_question_index = select_random_question();
        if (current_question_index == -1) {
            // All questions used
            if (score >= 10) {
                ESP_LOGI("QUIZ", "Timer: All questions used, score >= 10 - WINNER");
                quiz_state = QUIZ_STATE_WINNER;
                winner_counter = 0;
                show_winner_ui();
                lv_timer_set_period(quiz_timer, 100);  // 100 ms for winner timer
            } else {
                ESP_LOGI("QUIZ", "Timer: All questions used, score < 10 - FAIL");
                quiz_state = QUIZ_STATE_FAIL;
                fail_counter = 0;
                show_fail_ui();
                lv_timer_set_period(quiz_timer, 100);  // 100 ms for fail timer
            }
            second_counter = 0;
            break;
        }

        // Show a new question
        ESP_LOGI("QUIZ", "Timer: Showing question %d, setting state to WAITING_ANSWER", current_question_index);
        show_question_ui(current_question_index);
        quiz_state = QUIZ_STATE_WAITING_ANSWER;
        lv_timer_set_period(quiz_timer, 1000); // 1 second for countdown
        second_counter = 0;
        break;
    }

