esikora/ESP32-P4_ProjectWalda/main/project_walda_main.c
    case QUIZ_STATE_WAITING_ANSWER:
        if (second_counter >= 1) {
            timer_remaining--;
            update_countdown_display();
            second_counter = 0;

            if (timer_remaining <= 0) {
                // Time's up
                ESP_LOGI("QUIZ", "Timer: Time's up in WAITING_ANSWER - setting state to SHOWING_REACTION");
                quiz_state = QUIZ_STATE_SHOWING_REACTION;
                bool correct = false;
                if (score > 0) score--;
                tries++;
                update_score_display();
                show_reaction_ui(correct, "Die Zeit ist leider um!");
                lv_timer_set_period(quiz_timer, 2000); // show reaction 2 sec
                second_counter = 0;
            }
        }
        break;

    case QUIZ_STATE_SHOWING_REACTION:
        if (second_counter >= 2) {
            if (score >= 10) {
                ESP_LOGI("QUIZ", "Timer: Reaction shown, score >= 10 - WINNER");
                quiz_state = QUIZ_STATE_WINNER;
                winner_counter = 0;
                show_winner_ui();
                lv_timer_set_period(quiz_timer, 100);
            } else if (tries >= 50) {
                ESP_LOGI("QUIZ", "Timer: Reaction shown, tries >= 50 - FAIL");
                quiz_state = QUIZ_STATE_FAIL;
                fail_counter = 0;
                show_fail_ui();
                lv_timer_set_period(quiz_timer, 100);
            } else {
                ESP_LOGI("QUIZ", "Timer: Reaction shown, continuing to next question");
                quiz_state = QUIZ_STATE_SHOWING_QUESTION;
                lv_timer_set_period(quiz_timer, 100);
            }
            second_counter = 0;
        }
        break;

    case QUIZ_STATE_WINNER:
        winner_counter++;
        if (winner_counter >= 150) {  // 15 seconds
            ESP_LOGI("QUIZ", "Timer: Winner timeout - SHUTDOWN_PROMPT");
            quiz_state = QUIZ_STATE_SHUTDOWN_PROMPT;
            show_shutdown_prompt_ui();
            winner_counter = 0;
        }
        break;

    case QUIZ_STATE_FAIL:
        fail_counter++;
        if (fail_counter >= 50) {  // 5 seconds
            // Refresh fail screen occasionally (optional)
            show_fail_ui();
            fail_counter = 0;
        }
        break;

    case QUIZ_STATE_SHUTDOWN_PROMPT:
    case QUIZ_STATE_START_SCREEN:
    case QUIZ_STATE_IDLE:
    default:
        // nothing
        break;
    }
}

// === Answer handling in LVGL context via lv_async_call =======================

static void handle_answer_async(void *user_data)
{
    int btn_index = (int)user_data;

    ESP_LOGI("QUIZ", "handle_answer_async: Processing answer for button %d", btn_index);

    if (quiz_state != QUIZ_STATE_WAITING_ANSWER) {
        ESP_LOGW("QUIZ", "handle_answer_async: State is not WAITING_ANSWER (current: %d), ignoring", quiz_state);
        return;
    }

    user_answer = 'A' + btn_index;
    ESP_LOGI("QUIZ", "handle_answer_async: User selected answer %c", user_answer);
    highlight_answer_frame(btn_index);

    bool correct = (user_answer == quiz_questions[current_question_index].correct);
    ESP_LOGI("QUIZ", "handle_answer_async: Answer is %s (correct: %c)", correct ? "CORRECT" : "WRONG", quiz_questions[current_question_index].correct);
    if (correct) {
        score++;
    } else {
        if (score > 0) score--;
    }
    tries++;
    update_score_display();

    ESP_LOGI("QUIZ", "handle_answer_async: Setting state to SHOWING_REACTION");
    quiz_state = QUIZ_STATE_SHOWING_REACTION;
    show_reaction_ui(correct, NULL);
    lv_timer_set_period(quiz_timer, 3000); // 3 seconds reaction
}

// === Shutdown or restart from LVGL context ==================================

static void handle_start_quiz_async(void *user_data)
{
    (void)user_data;

    ESP_LOGI("QUIZ", "handle_start_quiz_async: Starting quiz initialization");
    init_quiz_logic();
    ESP_LOGI("QUIZ", "handle_start_quiz_async: Setting state to SHOWING_QUESTION");
    quiz_state = QUIZ_STATE_SHOWING_QUESTION;
    lv_timer_reset(quiz_timer);
    lv_timer_set_period(quiz_timer, 100);
    ESP_LOGI("QUIZ", "handle_start_quiz_async: Timer reset and period set");
}

static void handle_restart_async(void *user_data)
{
    (void)user_data;

    init_quiz_logic();
    quiz_state = QUIZ_STATE_SHOWING_QUESTION;
    lv_timer_reset(quiz_timer);
    lv_timer_set_period(quiz_timer, 100);
}

static void handle_shutdown_async(void *user_data)
{
    (void)user_data;
    esp_restart();
    // esp_deep_sleep_start();
}

// === Button event callback (no direct LVGL calls, only lv_async_call) ========

static void button_event_cb(void *arg, void *data)
{
    button_handle_t btn_handle = (button_handle_t)arg;
    button_event_t event = iot_button_get_event(btn_handle);

    int btn_index = -1;
    for (int i = 0; i < NUM_BUTTONS; i++) {
        if (buttons[i].handle == btn_handle) {
            btn_index = i;
            break;
        }
    }

    if (btn_index == -1) {
        ESP_LOGE("BUTTON", "Unknown button handle");
        return;
    }

    ESP_LOGI("BUTTON", "Button %d event: %s (current quiz_state: %d)",
             btn_index, iot_button_get_event_str(event), quiz_state);

    const char *color_names[] = {"BLUE", "GREEN", "RED"};
    ESP_LOGI("BUTTON", "%s button event: %s",
             color_names[btn_index], iot_button_get_event_str(event));

    if (BUTTON_PRESS_REPEAT == event || BUTTON_PRESS_REPEAT_DONE == event) {
        ESP_LOGI("BUTTON", "\tREPEAT[%d]", iot_button_get_repeat(btn_handle));
    }

    if (BUTTON_PRESS_UP == event || BUTTON_LONG_PRESS_HOLD == event || BUTTON_LONG_PRESS_UP == event) {
        ESP_LOGI("BUTTON", "\tPressed Time[%" PRIu32 " ms]", iot_button_get_pressed_time(btn_handle));
    }

    if (BUTTON_MULTIPLE_CLICK == event) {
        ESP_LOGI("BUTTON", "\tMULTIPLE[%d]", (int)data);
    }

    // Visual button state
    if (BUTTON_PRESS_DOWN == event) {
        buttons[btn_index].is_pressed = true;
    } else if (BUTTON_PRESS_UP == event) {
        buttons[btn_index].is_pressed = false;

        // Quiz logic (through async handlers) - only on BUTTON_PRESS_UP
        if (quiz_state == QUIZ_STATE_WAITING_ANSWER) {
            ESP_LOGI("QUIZ", "Button %d pressed in WAITING_ANSWER state - scheduling answer", btn_index);
            lv_async_call(handle_answer_async, (void *)btn_index);
        } else if (quiz_state == QUIZ_STATE_START_SCREEN) {
            // Any button starts the quiz
            ESP_LOGI("QUIZ", "Button %d pressed in START_SCREEN state - scheduling quiz start", btn_index);
            lv_async_call(handle_start_quiz_async, NULL);
        } else if (quiz_state == QUIZ_STATE_SHUTDOWN_PROMPT) {
            // Any button shuts down
            ESP_LOGI("QUIZ", "Button %d pressed in SHUTDOWN_PROMPT state - scheduling shutdown", btn_index);
            lv_async_call(handle_shutdown_async, NULL);
        } else if (quiz_state == QUIZ_STATE_FAIL) {
            if (btn_index == 1) { // Green button - restart
                ESP_LOGI("QUIZ", "Green button pressed in FAIL state - scheduling restart");
                lv_async_call(handle_restart_async, NULL);
            }
            // Removed long press shutdown from PRESS_UP
        }
    } else if (BUTTON_LONG_PRESS_HOLD == event && quiz_state == QUIZ_STATE_FAIL && btn_index == 2) {
        uint32_t pressed_ms = iot_button_get_pressed_time(btn_handle);
        if (pressed_ms >= 2000) {
            ESP_LOGI("QUIZ", "Red button held for >2s in FAIL state - scheduling shutdown");
            lv_async_call(handle_shutdown_async, NULL);
        }
    } else if (BUTTON_PRESS_END == event) {
        // TODO: is this needed, or is BUTTON_PRESS_UP sufficient?

